Tekla.Structures.Drawing.DetailMark.DetailMarkAttributes.DetailBoundaryShape
The boundary shapes of the detail mark.

Tekla.Structures.Drawing.DetailMark.DetailMarkAttributes.DetailBoundaryShape.None
No shape.

Tekla.Structures.Drawing.DetailMark.DetailMarkAttributes.DetailBoundaryShape.Circular
The circular shape.

Tekla.Structures.Drawing.DetailMark.DetailMarkAttributes.DetailBoundaryShape.Rectangular
The rectangular shape.